Тестовая_база_ERP_14/src/Documents/CRM_ПланированиеВоронкиПродаж/CRM_ПланированиеВоронкиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ПланированиеВоронкиПродаж</name>
  <registerRecords>InformationRegister.CRM_ПланыПоВоронкамПродаж</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПланирования</name>
    <type>
      <types>EnumRef.CRM_ОбъектыПланированияВоронкиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоронкаПродаж</name>
    <type>
      <types>CatalogRef.CRM_ВоронкиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПланирования</name>
    <type>
      <types>EnumRef.CRM_ВариантыПланированияВоронки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланирования</name>
    <type>
      <types>CatalogRef.CRM_ПериодыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелеваяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.CRM_ВоронкиПродаж</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПотенциальная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Конверсия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/CRM_СтатусыПланов/CRM_СтатусыПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыПланов</name>
  <enumValues>
    <name>НаСогласование</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/CRM_ВариантыПланированияВоронки/CRM_ВариантыПланированияВоронки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПланированияВоронки</name>
  <enumValues>
    <name>Эталон</name>
  </enumValues>
  <enumValues>
    <name>ПоКоличеству</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/CRM_ОбъектыПланированияВоронкиПродаж/CRM_ОбъектыПланированияВоронкиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ОбъектыПланированияВоронкиПродаж</name>
  <enumValues>
    <name>Предприятие</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Менеджер</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/CRM_ПланированиеВоронкиПродаж/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	ЭтотОбъект.Статус				= Перечисления.CRM_СтатусыПланов.НаСогласование;
	ЭтотОбъект.ВариантПланирования	= Перечисления.CRM_ВариантыПланированияВоронки.Эталон;
	// ЭтотОбъект.УдалитьДатаНачалаДействия	= CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	ЭтотОбъект.ОбъектПланирования	= Перечисления.CRM_ОбъектыПланированияВоронкиПродаж.Менеджер;
	ЭтотОбъект.Менеджер				= ЭтотОбъект.Автор;
	ЭтотОбъект.Подразделение		= Справочники.СтруктураПредприятия.ПустаяСсылка();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Инициализация дополнительных свойств для проведения документа.
	CRM_ОбщегоНазначенияСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.CRM_ПланированиеВоронкиПродаж.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	CRM_ОбщегоНазначенияСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	CRM_ОбщегоНазначенияСервер.ОтразитьПланированиеВоронкиПродаж(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	CRM_ОбщегоНазначенияСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбъектПланирования = Перечисления.CRM_ОбъектыПланированияВоронкиПродаж.Менеджер Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Менеджер"));
	КонецЕсли;
	
	Если НЕ ОбъектПланирования = Перечисления.CRM_ОбъектыПланированияВоронкиПродаж.Подразделение Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Подразделение"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
